Revit 2024 API
ConnectorElement.GetLinkedConnectorElement Method
 Get the linked connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ConnectorElement GetLinkedConnectorElement()
Visual Basic
Public Function GetLinkedConnectorElement As ConnectorElement
Visual C++
public:
ConnectorElement^ GetLinkedConnectorElement()
Return Value
 The linked connector element. If null, the connector has no link.
See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace